<template>
  <div id="terms-of-service">
    <header-nav/>
    <article>
      <h1 class="title is-1 has-text-centered">利　用　規　約</h1>
      <section>
        本規約は、@_slont（以下「当方」と称します）が提供する「Cullet」サービス（以下「本サービス」と称します）をご利用頂く際の取扱いにつき定めるものです。本規約に同意した上で本サービスをご利用ください。
      </section>
      <section>
        <h2 class="title is-2">第１条（定義）</h2>
        <div>本規約上で使用する用語の定義は、次に掲げるとおりとします。</div>
        <ul>
          <li>（1）本サービス  当方が運営するサービス</li>
          <li>（2）本コンテンツ   本サービス上で提供される文字、音、静止画、動画、ソフトウェアプログラム、コード等の総称（投稿情報を含む）</li>
          <li>（3）ユーザ    本サービスを利用する全ての方</li>
          <li>（4）ID   本サービスの利用のためにユーザが固有に持つ文字列</li>
          <li>（5）パスワード  IDに対応してユーザが固有に設定する暗号</li>
          <li>（6）投稿   ユーザが文章、文字列、画像、コメント等を掲載する行為</li>
          <li>（7）投稿情報 ユーザが投稿等により掲載した文章、文字列、画像、コメント等の情報の総称</li>
          <li>（8）個人情報 住所、氏名、職業、電話番号等個人を特定することのできる情報の総称</li>
          <li>（9）知的財産 発明、考案、植物の新品種、意匠、著作物その他の人間の創造的活動により生み出されるもの（発見または解明がされた自然の法則または現象であって、産業上の利用可能性があるものを含む）、商標、商号その他事業活動に用いられる商品または役務を表示するもの及び営業秘密その他の事業活動に有用な技術上または営業上の情報</li>
          <li>（10）知的財産権 特許権、実用新案権、育成者権、意匠権、著作権、商標権その他の知的財産に関して法令により定められた権利または法律上保護される利益に係る権利</li>
        </ul>
      </section>
      <section>
        <h2 class="title is-2">第２条（本規約への同意）</h2>
        <ul>
          <li>１　ユーザは、本利用規約に同意頂いた上で、本サービスを利用できるものとします。</li>
          <li>２　ユーザが、本サービスをスマートフォンその他の情報端末にダウンロードし、本規約への同意手続を行った時点で、ユーザと当方との間で、本規約の諸規定に従った利用契約が成立するものとします。</li>
          <li>３　ユーザが未成年者である場合には、親権者その他の法定代理人の同意を得たうえで、本サービスをご利用ください。</li>
          <li>４　未成年者のユーザが、法定代理人の同意がないにもかかわらず同意があると偽りまたは年齢について成年と偽って本サービスを利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合、本サービスに関する一切の法律行為を取り消すことは出来ません。</li>
          <li>５ 本規約の同意時に未成年であったユーザが成年に達した後に本サービスを利用した場合、当該ユーザは本サービスに関する一切の法律行為を追認したものとみなされます。</li>
        </ul>
      </section>
      <section>
        <h2 class="title is-2">第３条（規約の変更）</h2>
        <ul>
          <li>１　当方は、ユーザの承諾を得ることなく、いつでも、本規約の内容を改定することができるものとし、ユーザはこれを異議なく承諾するものとします。</li>
          <li>２　当方は本規約を改定するときは、その内容について当方からユーザへの通知はいたしかねます。</li>
          <li>３　前本規約の改定の効力は、当方が本サービスに変更後の規約を掲載した時点から生じるものとします。</li>
          <li>４　ユーザは、本規約変更後、本サービスを利用した時点で、変更後の本利用規約に異議なく同意したものとみなされます。</li>
        </ul>
      </section>
      <section>
        <h2 class="title is-2">第４条（アカウントの管理）</h2>
        <ul>
          <li>１　ユーザは、利用に際して登録した情報（以下、「登録情報」といいます。メールアドレスやID・パスワード等を含みます）について、自己の責任の下、任意に登録、管理するものとします。ユーザは、これを第三者に利用させ、または貸与、譲渡、名義変更、売買などをしてはならないものとします。</li>
          <li>２　当方は、登録情報によって本サービスの利用があった場合、利用登録をおこなった本人が利用したものと扱うことができ、当該利用によって生じた結果ならびにそれに伴う一切の責任については、利用登録を行った本人に帰属するものとします。</li>
          <li>３　ユーザは、登録情報の不正使用によって当方または第三者に損害が生じた場合、当方および第三者に対して、当該損害を賠償するものとします。</li>
          <li>４　登録情報の管理は、ユーザが自己の責任の下で行うものとし、登録情報が不正確または虚偽であったためにユーザが被った一切の不利益および損害に関して、当方は責任を負わないものとします。</li>
          <li>５　登録情報が盗用されまたは第三者に利用されていることが判明した場合、ユーザは直ちにその旨を当方に通知するとともに、当方からの指示に従うものとします。</li>
        </ul>
      </section>
      <section>
        <h2 class="title is-2">第５条（個人情報等の取り扱い）</h2>
        <div>個人情報及びユーザ情報については、当方が別途定める「プライバシーポリシー」に則り、適正に取り扱うこととします。</div>
      </section>
      <section>
        <h2 class="title is-2">第６条（禁止行為）</h2>
        <div>本サービスの利用に際し、当方は、ユーザ（以下「ユーザ」）に対し、次に掲げる行為を禁止します。当方において、ユーザが禁止事項に違反したと認めた場合、利用停止、投稿削除等、当方において必要と判断した措置を取ることができるものとし、ユーザはこれを異議なく同意するものとします。</div>
        <ul>
          <li>（１）当方または第三者の知的財産権を侵害する行為</li>
          <li>（２）当方または第三者の名誉・信用を毀損または不当に差別もしくは誹謗中傷する行為</li>
          <li>（３）当方または第三者の財産を侵害する行為、または侵害する恐れのある行為</li>
          <li>（４）当方または第三者に経済的損害を与える行為</li>
          <li>（５）当方または第三者に対する脅迫的な行為</li>
          <li>（６）ユーザが、以下の情報を投稿すること</li>
          <li>
            <ul>
              <li>①第三者の権利および財産に対して損害を与えるリスクのある情報</li>
              <li>②第三者に対して有害な情報、第三者を身体的・心理的に傷つける情報</li>
              <li>③犯罪や不法行為、危険行為に属する情報およびそれらを教唆、幇助する情報</li>
              <li>④不法、有害、脅迫、虐待、人種差別、中傷、名誉棄損、侮辱、ハラスメント、扇動、不快を与えることを意図し、もしくはそのような結果を生じさせる恐れのある内容をもつ情報</li>
              <li>⑤事実に反する、または存在しないと分かっている情報</li>
              <li>⑥ユーザ自身がコントロール可能な権利を持たない情報</li>
              <li>⑦第三者の著作権を含む知的財産権やその他の財産権を侵害する情報、公共の利益または個人の権利を侵害する情報</li>
              <li>⑧わいせつ、児童ポルノまたは児童虐待にあたる画像、文書等の情報</li>
              <li>⑨医師法などの法令に違反する情報</li>
              <li>⑩その他当方が不適切と判断する情報</li>
            </ul>
          </li>
          <li>（７）コンピューターウィルス、有害なプログラムを仕様またはそれを誘発する行為</li>
          <li>（８）本サービス用インフラ設備に対して過度な負担となるストレスをかける行為</li>
          <li>（９）当サイトのサーバーやシステム、セキュリティへの攻撃</li>
          <li>（１０）当方提供のインターフェース以外の方法で当方サービスにアクセスを試みる行為</li>
          <li>（１１）一人のユーザが、複数のユーザIDを取得する行為</li>
          <li>（１２）上記の他、当方が不適切と判断する行為</li>
        </ul>
      </section>
      <section>
        <h2 class="title is-2">第７条 （コンテンツの取り扱い）</h2>
        <ul>
          <li>１　ユーザは､本サービスのコンテンツを当方の定める範囲内でのみ使用することができるものとします｡</li>
          <li>２　ユーザは、すべてのコンテンツに対して有する権利を従前どおり保持し、当方がかかる権利を取得することはありません。ただし、ユーザは、本サービスの利用により、当方に対し、コンテンツを利用する権利（営利目的の有無を問わず、複製、上演、演奏、上映、公衆送信、公衆伝達、口述、展示、頒布、譲渡、貸与、翻訳、翻案、（当方が事業目的上必要とみなす範囲で）改変する権利を含みます。また、これらの権利を第三者に再許諾する権利を含みます。）を無償でかつ無期限に、地域の限定なく許諾したこととなり、当方はかかる利用権を取得します。この場合、ユーザは、コンテンツに関する著作者人格権を当方または当方の指定する第三者による上記範囲での利用に対して行使しないことにも同意したこととなります。</li>
          <li>３　ユーザは､当方の定める使用範囲を超えていかなる方法によっても複製､送信､譲渡（ユーザ同士の売買も含みます）､貸与､翻訳､翻案、無断で転載、二次使用、営利目的の使用、改変、逆アセンブル、逆コンパイル、リバースエンジニアリング等を行う事を禁止します。</li>
          <li>４　前項に関わらず､退会等によりユーザがユーザ資格を喪失した場合は､提供されたコンテンツの使用権も消滅するものとします｡</li>
          <li>５　ユーザが、本サービス上に投稿その他の方法で送信したコンテンツ（静止画、動画、文字情報その他一切の情報）に関する著作権（著作権法第21条ないし同第28条に規定する権利を含む全ての著作権を含む。）についてはユーザに帰属するものとします。ただし、ユーザは、コンテンツの送信時に、当方に対し、日本国内外において、当該コンテンツを無償かつ非独占的に使用することを許諾します。</li>
          <li>６　ユーザは本サービス内では、著作者人格権を行使しないものとします。</li>
        </ul>
      </section>
      <section>
        <h2 class="title is-2">第８条（免責）</h2>
        <ul>
          <li>１　当方は、本サービスの内容変更、中断、終了によって生じたいかなる損害についても、一切責任を負いません。</li>
          <li>２　当方は、ユーザの本サービスの利用環境について一切関与せず、また一切の責任を負いません。</li>
          <li>３　当方は、本サービスがユーザの特定の目的に適合すること、期待する機能・商品的価値・正確性・有用性を有すること、ユーザによる本サービスの利用がユーザに適用のある法令または業界団体の内部規則等に適合すること、および不具合が生じないことについて、何ら保証するものではありません。</li>
          <li>４　当方は、本サービスが全ての情報端末に対応していることを保証するものではなく、本サービスの利用に供する情報端末のＯＳのバージョンアップ等に伴い、本サービスの動作に不具合が生じる可能性があることにつき、ユーザはあらかじめ了承するものとします。当方は、かかる不具合が生じた場合に当方が行うプログラムの修正等により、当該不具合が解消されることを保証するものではありません。</li>
          <li>５　ユーザは、AppStore、GooglePlay等のサービスストアの利用規約および運用方針の変更等に伴い、本サービスの一部又は全部の利用が制限される可能性があることをあらかじめ了承するものとします。</li>
          <li>６　当方は、本サービスを利用したことにより直接的または間接的にユーザに発生した損害について、一切賠償責任を負いません。</li>
          <li>７　当方は、ユーザその他の第三者に発生した機会逸失、業務の中断その他いかなる損害（間接損害や逸失利益を含みます）に対して、当方が係る損害の可能性を事前に通知されていたとしても、一切の責任を負いません。</li>
          <li>８　他のユーザまたは第三者から投稿についての削除依頼があった時、当方の判断で削除の可否を決定できるものとし、当該判断により生じた一切の責任について、当方は責任を負わないものとします。</li>
          <li>９　第１項乃至前項の規定は、当方に故意または重過失が存する場合又は契約書が消費者契約法上の消費者に該当する場合には適用しません。</li>
          <li>１０　前項が適用される場合であっても、当方は、過失（重過失を除きます。）による行為によってユーザに生じた損害のうち、特別な事情から生じた損害については、一切賠償する責任を負わないものとします。</li>
          <li>１１　本サービスの利用に関し当方が損害賠償責任を負う場合、当該損害が発生した月にユーザから受領した利用額を限度として賠償責任を負うものとします。</li>
          <li>１２　ユーザと他のユーザとの間の紛争及びトラブルについて、当方は一切責任を負わないものとします。ユーザと他のユーザでトラブルになった場合でも、両者同士の責任で解決するものとし、当方には一切の請求をしないものとします。</li>
          <li>１３　ユーザは、本サービスの利用に関連し、他のユーザに損害を与えた場合または第三者との間に紛争を生じた場合、自己の費用と責任において、かかる損害を賠償またはかかる紛争を解決するものとし、当方には一切の迷惑や損害を与えないものとします。</li>
          <li>１４　ユーザの行為により、第三者から当方が損害賠償等の請求をされた場合には、ユーザの費用（弁護士費用）と責任で、これを解決するものとします。当方が、当該第三者に対して、損害賠償金を支払った場合には、ユーザは、当方に対して当該損害賠償金を含む一切の費用（弁護士費用及び逸失利益を含む）を支払うものとします。</li>
          <li>１５　ユーザが本サービスの利用に関連して当方に損害を与えた場合、ユーザの費用と責任において当方に対して損害を賠償（訴訟費用及び弁護士費用を含む）するものとします。</li>
          <li>１６　本サービスで他のユーザが投稿した情報の正確性について、当方は保証しません。当方は、本サービスに掲載されている情報についての紛争及びトラブルについて一切の責任を負いません。</li>
        </ul>
      </section>
      <section>
        <h2 class="title is-2">第９条（広告の掲載について）</h2>
        ユーザは、本サービス上にあらゆる広告が含まれる場合があること、当方またはその提携先があらゆる広告を掲載する場合があることを理解しこれを承諾したものとみなします。本サービス上の広告の形態や範囲は、当方によって随時変更されます。
      </section>
      <section>
        <h2 class="title is-2">第１０条（権利譲渡の禁止）</h2>
        <ul>
          <li>１　ユーザは、予め当方の書面による承諾がない限り、本規約上の地位および本規約に基づく権利または義務の全部または一部を第三者に譲渡してはならないものとします。</li>
          <li>２　当方は、本サービスの全部または一部を当方の裁量により第三者に譲渡することができ、その場合、譲渡された権利の範囲内でユーザのアカウントを含む、本サービスに係るユーザの一切の権利が譲渡先に移転するものとします。</li>
        </ul>
      </section>
      <section>
        <h2 class="title is-2">第１１条（分離可能性）</h2>
        本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効又は執行不能と判断された場合であっても、本規約の残りの規定及び一部が無効又は執行不能と判断された規定の残りの部分は、継続して完全に効力を有するものとします。
      </section>
      <section>
        <h2 class="title is-2">第１２条（当方への連絡方法）</h2>
        本サービスに関するユーザの当方へのご連絡・お問い合わせは、本サービスまたは当方が運営するwebサイト内の適宜の場所に設置するお問い合わせフォームからの送信または当方が別途指定する方法により行うものとします。
      </section>
      <section>
        <h2 class="title is-2">第１３条（準拠法、管轄裁判所）</h2>
        <ul>
          <li>１　本規約の有効性，解釈及び履行については，日本法に準拠し，日本法に従って解釈されるものとする。</li>
          <li>２　当方とユーザ等との間での論議・訴訟その他一切の紛争については、訴額に応じて、東京簡易裁判所又は東京地方裁判所を専属的合意管轄裁判所とします｡</li>
        </ul>
      </section>
      <section>２０１８年６月１日　施行</section>
    </article>
    <footer-nav class="is-hidden-tablet"/>
  </div>
</template>

<script>
  import HeaderNav from '@/components/HeaderNav'
  import FooterNav from '@/components/FooterNav'

  export default {
    components: {HeaderNav, FooterNav}
  }
</script>

<style lang="scss" rel="stylesheet/scss">
  #terms-of-service {
    height: 100vh;
    background-color: white;
    padding-top: $header-nav-height;

    article {
      width: $width;
      max-width: 100%;
      margin: auto;
      padding: 1rem 3rem 6rem;

      section {
        &:not(:last-child) {
          margin-bottom: 2rem;
        }
        ul > li > ul {
          padding-left: 2rem;
        }
      }
    }

    @media screen and (max-width: 768px) {
      padding-bottom: $footer-nav-height;
    }
  }
</style>
